[
 {
 	"title" : "Music App UI",
 	"tags" : "UI - Flutter",
    "desc" : "The is a simple flutter UI design that was inspired by a design from dribble. The main aspect of the UI was to create an transition when the user clicks on the play/pause button.",
 	"projectLink" : true,
    "link" : "https://github.com/NishanthPrajith/musicAppUI",
    "imageColor" : "#142024",
    "videoCondition" : false,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Food App UI",
 	"tags" : "UI - Flutter - Dribble",
    "desc" : "A simple flutter UI design. The project features no interaction, it was done merely as a learning experierence, but it ended up looking good.",
 	"projectLink" : false,
    "imageColor" : "#8CC88B",
    "videoCondition" : false,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Google Maps App UI",
 	"tags" : "UI - Flutter",
    "desc" : "My first test at using the Google Maps API in a flutter app. In addition I was also able to include a custom map whose styles where generated by google's own map styling website. The whole reason for this project was in regards to a reservation app I was planning on doing with the friends. However, we soon realized that the market did not have much opportunity for growth.",
 	"projectLink" : false,
    "imageColor" : "#EFE3CD",
    "videoCondition" : false,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Events App UI",
 	"tags" : "UI - Flutter - Animation",
    "desc" : "A flutter app that recreated a UI design on a website. The main key catching component of this UI design was the slider button which was quite unique.",
 	"projectLink" : true,
    "link" : "https://github.com/NishanthPrajith/EventsAppUI",
    "imageColor" : "#E4D7C9",
    "videoCondition" : true,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Password Reveal UI",
 	"tags" : "UI - Flutter - Instagram - Animation",
 	"projectLink" : true,
   "desc" : "A flutter app featuring a very unique interaction. I saw this on Instagram where someone created a similar interaction using Swift but I decided to create it in Flutter. The interaction is a flashlight which when clicked reveals the password the user entered. But, it also makes the flashlight icon literally flash light. Credit to the original creator, sorry I do not have your Instagram handle.",
    "link" : "https://github.com/NishanthPrajith/passwordRevealer",
    "imageColor" : "#142024",
    "videoCondition" : true,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Marathon Finder UI",
 	"tags" : "UI - Flutter - Dribble - Web app",
 	"projectLink" : false,
    "desc" : "A flutter web app that recreated a UI design on dribble. This was my first time attempting to make a flutter web app. I wanted to make it responsive but found it too hard to do that since I did not have much experience in that area. ",
    "imageColor" : "#5BA079",
    "videoCondition" : false,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Nature App UI",
    "imageColor" : "#0B2944",
 	"tags" : "UI - Flutter - Dribble - Transition - Animation",
   "desc" : "A flutter web app that recreated a UI design on dribble. This was a very interesting project which used the change notifier package along with the page view flutter widget to create a transition that appeared when the page was scrolled down. I learned a lot of about flutter packagae and change notifier to create scroll animations such as this one.",
 	"projectLink" : false,
    "videoCondition" : true,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Fluid Card UI",
 	"tags" : "UI - Flutter - Dribble - Transition - Animation",
    "desc" : "The is a simple flutter UI design that was inspired by a design from dribble. Althought, this interaction is not perfect it was hard coded to create the effect instead of using something like the 'slimy card' package.",
 	"imageColor" : "#463A67",
    "projectLink" : true,
    "link" : "https://github.com/NishanthPrajith/fluidcard",
    "videoCondition" : true,
    "language" : ["Dart/Flutter"]
 },
 {
 	"title" : "Image Uploader Program",
 	"tags" : "Python - Github",
    "desc" : "Takes an image and uploads it to the website along with the necessary code. This program was written by me to make it easier to upload images to my portfolio website. It added all the necessary HTML code and pushed it all directly to GitHub, without me doing any of the hard manual labor.",
 	"projectLink" : true,
    "imageColor" : "#131C29",
    "link" : "https://github.com/NishanthPrajith/Image_Uploader",
    "videoCondition" : false,
    "language" : ["Python"]
 },
 {
 	"title" : "Convex Hull Visualization",
 	"tags" : "Convex Hull - HTML - CSS - JS",
    "desc" : "A simple visualization I made to showcase different convex hull algorithms such as graham scan, quick hull and divide & conquer. Just to make sure the controls is as simple as possible, all you as the user needs to do is click on the algorithm from the list at the top and let the javascript do the rest of the work. Once clicked the algorithm will begin executing. And only once the current execution is finished you the user will be allowed to choosen a different algorithm.",
    "imageColor" : "#EDEDEE",
    "projectLink" : true,
    "link" : "https://github.com/NishanthPrajith/Convex_Hull_Visualization",
    "weblink" : "https://nishanthprajith.github.io/Convex_Hull_Visualization/",
    "videoCondition" : true,
    "language" : ["HTML, CSS, JS"]
 },
 {
 	"title" : "Recycle App UI",
 	"tags" : "UI - Flutter",
    "desc" : "Our project aims to help users find all the garbage disposal locations near them. They would open the app on their phones to see on the maps to find the nearest one. We plan on having every user have an account for this application.",
 	"projectLink" : true,
    "link" : "https://github.com/Garbage-Disposal-Locations-App/Garbage-Disposal-Locations-App",
    "videoCondition" : false,
    "language" : ["Dart/Flutter"]
 }
]